package com.app.taxi.myTaxy;

import android.app.Activity;
import android.content.Intent;
import android.database.sqlite.SQLiteDatabase;
import android.os.Bundle;
import android.telephony.PhoneNumberFormattingTextWatcher;
import android.text.Editable;
import android.text.TextWatcher;
import android.view.Menu;
import android.view.MenuItem;
import android.view.View;
import android.widget.ArrayAdapter;
import android.widget.AutoCompleteTextView;
import android.widget.CheckBox;
import android.widget.EditText;

import android.widget.TextView;
import android.widget.Toast;

import com.app.taxi.myTaxi.R;


public class MainActivity extends Activity implements TextWatcher {


    private AutoCompleteTextView orderFrom;
    private AutoCompleteTextView orderTo;
    private TextView orderNumber;


    private CheckBox checkWithFriend;
    private CheckBox checkWithAnimal;
    private CheckBox checkWith5ppl;
    private CheckBox checkWithWeapon;

    private EditText PhoneNumberEntry;
    private Toast toastInfoCheck;

    PhoneNumberFormattingTextWatcher PhoneWatcher = new PhoneNumberFormattingTextWatcher();


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);


        PhoneNumberEntry = (EditText) findViewById(R.id.textMain_number);
        PhoneNumberEntry.addTextChangedListener(PhoneWatcher);

        orderFrom = (AutoCompleteTextView) findViewById(R.id.textMain_from);
        orderFrom.addTextChangedListener(this);
        orderFrom.setAdapter(new ArrayAdapter(this,
                android.R.layout.simple_dropdown_item_1line, Lviv_streets));

        orderTo = (AutoCompleteTextView) findViewById(R.id.textMain_to);
        orderTo.addTextChangedListener(this);
        orderTo.setAdapter(new ArrayAdapter(this,
                android.R.layout.simple_dropdown_item_1line, Lviv_streets));


        orderNumber = (TextView) findViewById(R.id.textMain_number);
        orderNumber.setText("+380639810577");

        checkWithFriend = (CheckBox) findViewById(R.id.drunkFriend);
        checkWithAnimal = (CheckBox) findViewById(R.id.checkBox2);
        checkWith5ppl = (CheckBox) findViewById(R.id.checkBox3);
        checkWithWeapon = (CheckBox) findViewById(R.id.checkBox4);

        // Инициализируем наш класс-обёртку
        SQLite_db sqh = new SQLite_db(this);
        // База нам нужна для записи и чтения
        SQLiteDatabase sqdb = sqh.getWritableDatabase();
        // закрываем соединения с базой данных
        sqdb.close();
        sqh.close();
    }


    @Override
    public boolean onCreateOptionsMenu(Menu menu) {
        // Inflate the menu; this adds items to the action bar if it is present.
        getMenuInflater().inflate(R.menu.menu_main, menu);
        return true;
    }

    @Override
    public boolean onOptionsItemSelected(MenuItem item) {
        int id = item.getItemId();

        //noinspection SimplifiableIfStatement
        if (id == R.id.action_settings) {
            return true;
        }

        return super.onOptionsItemSelected(item);
    }

    public void sendDataFromMainToConfirm(View view) {
        Intent intent = new Intent(getApplicationContext(), Confirm_after_order.class);

        intent.putExtra("From", orderFrom.getText().toString());
        intent.putExtra("To", orderTo.getText().toString());
        intent.putExtra("Number", orderNumber.getText().toString());

        if (checkWithFriend.isChecked()) {
            intent.putExtra("Drunk", checkWithFriend.getText().toString());
        }


        if (orderNumber.length() == 16) {
            orderNumber.setTextColor(getResources().getColor(R.color.black));
            startActivity(intent);
        } else {
            orderNumber.setTextColor(getResources().getColor(R.color.red));
            toastInfoCheck = Toast.makeText(getApplicationContext(), "Wrong number", Toast.LENGTH_SHORT);
            toastInfoCheck.show();
        }

    }

    @Override
    public void afterTextChanged(Editable arg0) {
        // TODO Auto-generated method stub
    }

    @Override
    public void beforeTextChanged(CharSequence s, int start, int count, int after) {
        // TODO Auto-generated method stub
    }

    @Override
    public void onTextChanged(CharSequence s, int start, int before, int count) {
        // TODO Auto-generated method stub
    }

    final String[] Lviv_streets = {" 700-річчя Львова пл. ", " Абхазька ", " Авіаційна ", " " +
            "Автобудівельників проїзд ", " Автовокзал ", " Агабек-заде ", " Агрусова ", " Аеропорт ",
            " Азовська ", " Айвазовського ", " Акацієва ", " Алмазна ", " Алмазова ", " Алчевської ",
            " Ангарна ", " Ангеловича ", " Антоненка-Давидовича ", " Антонича ", " Антоновича ",
            " Апостола Данила ", " Аральська ", " Аркаса ", " Арсенальська ", " Архипенка ",
            " Архітекторська ", " Бабія ", " Багалія ", " Багряного ", " Бажана ",
            " Базальтова ", " Базарна ", " Бакинська ", " Балабана ", " Балкова ",
            " Балтійська ", " Бальзака ", " Банаха ", " Бандери ", " Бандрівського ",
            " Банківська ", " Барбарисова ", " Барвінок Ганни ", " Барвінських ", " Баронча ",
            " Басараб ", " Батуринська ", " Бахматюка ", " Бачинського ", " не існує ", " Баштанна ",
            " Белзька ", " Бенцаля ", " Бережанська ", " Березова ", " Берестяна ", " Беринди ",
            " Бескидська ", " Бетховена ", " Біберовича ", " Бібліотечна ", " Бігова ", " Біласа ",
            " не існує ", " Білинського ", " Білогорща ", " Білоруська ", " Білоцерківська ", " Біляшівського ",
            " Блажкевич Іванни ", " Боберського ", " Бобинського ", " Богданівська ", " Богомольця ", " Богуна ",
            " Боднарська ", " Бодянського ", " Бойківська ", " Бойчука ", " Бой-Желенського ", " Болбачана ",
            " Болгарська ", " Бориславська ", " Боровиковського ", " Бортнянського ", " Ботанічна ", " Ботєва ",
            " Боткіна ", " Братня ", " Братуня ", " Бринського ", " Броварна ", " Бродівська ", " Бруснична ",
            " Бруснівська ", " Брюллова ", " Брюховицька ", " не існує ", " Бузинова ", " Бузкова ", " Буйка ",
            " Букова ", " Буковинська ", " Буська ", " Буцманюка ", " Бучми ", " Вагилевича ", " Вагова ",
            " Вагонна ", " Валова ", " Варшавська ", " Васильківського ", " Васильченка ", " Вахнянина ",
            " Вашингтона ", " Веделя ", " Величка Самійла ", " Величковського (Рясне-2) ", " Венеціанова ",
            " Вербицького ", " Вербова ", " Вересая ", " Вернадського ", " Вернигори ", " Верхратського ",
            " Вершницька ", " Весела ", " Весняна ", " Ветеранів ", " Вечірня ", " Вигін ", " Виговського ",
            " Вигода ", " Визвольна ", " Вилітна ", " Винниківська ", " Винниківське озеро ",
            " Винниця ", " Винниченка ", " Виноградна ", " Випасова ", " Висока ", " Високий Замок вул. ",
            " Височана ", " Вишенського ", " Вишиваного пл. ", " Вишнева ", " Вівсяна ", " Відкрита ",
            " Війтовича ", " Вільде ", " Вільхова ", " Вірменська ", " Вітвера ", " Вітовського ", " Вітрякова ",
            " Вітряна ", " Вічева вул. ", " Вічева пл. ", " Вовка ", " Вовчка ", " Водна ", " Водогінна ",
            " Возняка ", " Вокзал залізничний головний ", " Волинська ", " Володимира Великого ", " Волоська ",
            " Волошина ", " Волошкова ", " Волощака ", " Воля ", " Воробкевича ", " Вороного ", " Врізана ",
            " Врубеля ", " Втіха ", " Вугільна ", " Вузька ", " Вулецька ", " не існує ", " Гавришкевича ",
            " Газова ", " Гайворонського ", " Гайдамацька ", " Гайдучка ", " Гайова ", " Гайовської ", " Галечко ",
            " Галицька ", " Галицька пл. ", " Галицького пл. ", " Галілея ", " Гамалії ", " Ганкевича ",
            " Ганцова ", " Гарматія ", " Гашека ", " Гвардійська ", " Раковського ", " Героїв Крут ",
            " Героїв УПА ", " Герцена ", " Геца ", " Гіацинтова ", " Гіпсова ", " Гірника ", " Глибока ",
            " Глиняна ", " Глинянський Тракт ", " Глібова ", " Глінки ", " Глухий Кут ", " Гнатевича ",
            " Гнатюка ", " Гніздовського ", " Гоголя ", " Годованця ", " Голинського ", " Головатого ",
            " Головацького Я. ", " Голубина ", " Голубовича ", " Голубця ", " Гонти ", " Горбачевського ",
            " Горбкова ", " Гординських ", " Гордієнка ", " Горівська ", " Горіхова ", " Горішня ",
            " Горліса-Горського ", " Горобинна ", " Городницька ", " Городоцька ", " Горської ", " Господарська ",
            " Гостинна ", " Грабова ", " Грабовського ", " Грабянки ", " Гранична ", " Гранітна ", " Гребінки ",
            " Грекова ", " Грецька ", " Гречана ", " Грибова ", " Григоренка пл. ", " Григоровича ", " Грицая ",
            " Грінченка ", " не існує ", " Грузинська ", " Грунтова ", " Грушева ", " Грушевського ",
            " Грюнвальдська ", " Грядкова ", " Гулака-Артемовського ", " Гуні ", " Гуцульська ", " Гушалевича ",
            " Дагестанська ", " Дальня ", " Данилишина ", " Дашкевича ", " Двірцева пл. ", " не існує ",
            " Декарта ", " Демнянська ", " Детька ", " Джерельна ", " Дзиндри ", " Дивізійна ", " Диктова ",
            " Динівська ", " Діаманда ", " Дібровна ", " Дідушка ", " не існує ", " не існує ", " Дніпрової Чайки ",
            " Дніпровська ", " Дністерська ", " Довбуша ", " Довга (№№ 1,3,5) ", " Довга (№№ > 5) ", " Довженка ",
            " Дозвільна ", " Долинського ", " Долішня ", " Донецька ", " Донцова ", " Доробок ", " Дорогичинська ",
            " Дороша ", " Дорошенка ", " Досвітня ", " Доступна ", " Драгана "," Драгоманова ", " Драй-Хмари ",
            " Дріжджова ", " Дрогобицька ", " Дрогобича ", " Друкарська ", " не існує ", " Дублянська ",
            " Дубнівська ", " Дубова ", " Дубовицька ", " Дудаєва ", " Дунайська ", " Духновича ", " Дучимінської ",
            " Емінеску ", " Енергетична ", " Естонська ", " Євського ", " Єрошенка ", " Єфремова ", " Жасминова ",
            " Ждахи ", " Жемчужникова ", " Жижки ", " Житня ", " Житомирська ", " Жнивна ", " Жовківська ",
            " Жуковського ", " Журавлина ", " Заболотівська ", " Заводська ", " Загірна ", " Загородня ",
            " Загула Д. ", " Заклинських ", " Залізнична ", " Залізняка ", " Залісна ", " Замарстинівська ",
            " Заміська ", " Замкнена ", " Замкова ", " Заньковецької ", " Заозерна ", " Заозерний 1-й провулок ",
            " Заозерний 2-й провулок ", " Заозерний 3-й провулок ", " Заозерний 4-й провулок ",
            " Заозерний 5-й провулок ", " Заозерний 6-й провулок ", " Запашна ", " Заповітна ", " Запольської ",
            " Запорізька ", " Зарицьких ", " Засядька ", " Затишна ", " Захарієвича ", " Збаразька ",
            " Збиральна ", " Збоїща ", " Зборівська ", " Звенигородська пл. ", " Зв'язкова ", " Здоров'я ",
            " Зелена ", " Земельна ", " Землеробна ", " Зернова (пл.) ", " Зерова М. ", " Зигзаг ",
            " Зимновідська ", " Зимова ", " Зимова горішня ", " Зимова долішня ", " Золота ", " Золочівська ",
            " Зоряна ", " Зрубова ", " Зубрицького ", " Зубрівська ", " Зустрічна ", " Іванова Гора ", " Івасюка ",
            " Ігорева ", " Ільмова ", " Інструментальна ", " Ірчана ", " Кавалерідзе ", " Кавказька ", " Каганця ",
            " Казахська ", " Каліча Гора ", " Калнишевського ", " Каменярів ", " Камінна ", " Кам'янецька ",
            " Кам'янка ", " Канівська ", " Караджича ", " Караїмська ", " Карбишева ", " Карманського ",
            " Кармелюка ", " Карпатська ", " Карпинця ", " Карпінського О. ", " Кастелівка ", " Катедральна пл. ",
            " Каховська ", " Качали ", " Каштанова ", " Квітки-Основ'яненка ", " Квітнева ", " Квітова ",
            " Кедрова ", " Керамічна ", " Керченська ", " Кибальчича ", " Київська ", " не існує ",
            " Кирила і Мефодія ", " Кирилівська ", " Китайська ", " Кишинівська ", " Кінцева ", " Стешенка ",
            " Клепарівська ", " Клепарів станція ", " Климових братів ", " Кльоновича ", " Княгині Ольги ",
            " Княжа ", " Князя Романа ", " Князя Святослава пл. ", " Князя Осмомисла пл. ", " Кобзарська ",
            " Кобилиці ", " Кобилянської ", " Кобринської ", " Ковалева ", " Ковалевської ", " Ковалика ",
            " Ковальська ", " Ковельська ", " Коверка ", " Ковжуна ", " Ковча Ом. ", " Козацька ",
            " Козельницька ", " Козика ", " Козланюка ", " Козловського ", " Кокорудза ", " Колесси ",
            " Коліївщини пл. ", " Колійна ", " Колісна ", " Колодзінського ", " Колодійська ", " Колодязьна ",
            " Коломийська ", " Колоскова ", " Колумба ", " Кольберга ", " Комаринця ", " Комарова ", " Кондратюка ",
            " Кондукторська ", " Кониського ", " Коновальця ", " Цісик ", " Конопницької ", " Конотопська ",
            " Конюшинна ", " Кооперативна ", " Копальна ", " Копальна ", " Копача ", " Коперника ",
            " Копистинського ", " Кордуби ", " Корейська ", " Корецька ", " Корінна ", " Коріятовича ",
            " Корнякта ", " Короленка ", " Корольова ", " Коротка ", " Корпанюків ", " Корсунська ",
            " Кортумівка ", " Коряцька ", " Косинського ", " Космічна ", " Костомарова ", " Костюшка ",
            " Кос-Анатольського ", " Котика Б. ", " Котка ", " Котляревського ", " Котлярська ", " Коціловського ",
            " Коцка Анд. ", " Коцюбинського ", " Кочегарська ", " Кошиця ", " Кошова ", " Кравецька ",
            " Кравса ", " Кравченко ", " Кравчука ", " Крайня ", " Краківська ", " Красівська ", " Краснянська ",
            " Кревецького ", " Кременецька ", " Крехівська ", " Крива Липа проїзд ", " Кривоноса ",
            " Кривчицька Дорога ", " Кримська ", " не існує ", " Крип'якевича ", " Кричевського ",
            " Кропивницького пл. ", " Кругла ", " Кругова ", " Круп'ярська ", " Крута ", " Крушельницьких родини ",
            " Крушельницької ", " Кубанська ", " Кубійовича ", " Кузневича ", " Кузнярівка ", " Кузьми ",
            " Кукурудзяна ", " Куликівська ", " Куліша ", " Кульпарківська ", " Кульчицької ", " Купали ",
            " Купальська ", " Купчинського ", " Курбаса ", " Курильська ", " Курінна ", " Курмановича ",
            " Кутова ", " Кучера ", " Кушевича ", " Кущова ", " Лаврівського ", " Лазаренка ", " Лазєнна ",
            " Ламана ", " Ланова ", " Ластів'яча ", " Латвійська ", " Лебедина ", " Левандівська ", " Левинського ",
            " Левицького ", " Лемика ", " Лемківська ", " Ленона Джона ", " Леонтовича ", " Лепкого ",
            " Ливарна ", " Лижв'ярська ", " Липи ", " Липинського ", " Липківського ", " Липнева пл. ",
            " Липова Алея ", " Лисиницька ", " Лисенка ", " Листова ", " Листопадна ", " Листопадового Чину ",
            " Литвиненка ", " Литовська ", " Личаківська ", " Личаків станція ", " Лікувальна ", " Лінкольна ",
            " Лірницька ", " Лісна ", " Лісна (Сихів) ", " Ліста ", " Ліська ", " Літня ", " Ліщинова ",
            " Лобачевського ", " Ловецька ", " Лодія ", " Лотоцького ", " Луганська ", " Лугова ", " Лукасевича ",
            " Лукаша ", " Лукича ", " Лукіяновича ", " Луцька ", " Луцького ", " Лучкая ", " Лушпинського ",
            " Льва ", " Льняна ", " Любачивська ", " Любінська ", " Людкевича ", " Люльки ", " Лютнева ",
            " Ляйнберга ", " Магазинова ", " Мазепи ", " Маївського ", " Майданна ", " Майорівка ", " Маковея ",
            " Максимовича ", " Мала "," Маланюка пл. ", " Малинова ", " Малицької ", " Малі Кривчиці ",
            " Малковицька ", " Малоголосківська ", " Манастирського ", " Мартовича ", " Марунька ",
            " Маршалівка ", " Масарика ", " Матейка ", " Мацієвича ", " Машиністів ", " Меблярська ",
            " Медведецького ", " Медова ", " Медової Печери ", " Межова ", " Мележа ", " Мельника ",
            " Мельничука ", " Менделєєва ", " Менцинського ", " Меретина ", " Металістів ", " Метлинського ",
            " Метрологічна ", " Механічна ", " Мечникова ", " Микитки ", " Миколайчука ", " Мила ",
            " Милорадович ", " Милятинська ", " Миргородська ", " Мирна ", " Мирного ", " Мисливська ",
            " Митна пл. ", " Митрополита Андрея ", " Михальчука ", " Мишуги ", " Мідна ", " Міжгірна ",
            " Міклухо-Маклая ", " Міртова ", " Міхновських братів ", " Міцкевича пл. ", " Млинова ",
            " Мови Василя ", " Могили ", " Могильницького ", " Молдавська ", " Молодіжна ", " Молочна ",
            " Монгольська ", " не існує ", " не існує ", " не існує ", " не існує ", " не існує ",
            " Моринецька ", " Морозенка ", " Морозна ", " Моршинська ", " Мостова ", " Мосяжна ", " Моторна ",
            " Моха ", " Мудрого Ярослава ", " Музейна пл. ", " Музики ", " Мукачівська ", " Мулярська ", " Мундяк ",
            " Мурави Марка ", " Мурашка ", " Мурована ", " Мучна ", " Мушака ", " Навколишня ", " Навої Алішера ",
            " Навроцького ", " Нагірна ", " Нагірних ", " Надійна ", " Над'ярна ", " Над Джерелом ", " Назарука ",
            " Наливайка ", " Нарбута ", " Народна ", " Нарцисова ", " Насипна ", " Насінна ", " Наступальна ",
            " Наукова ", " Нафтова ", " На Копані ", " На Нивах ", " На Сторожі ", " На Чвертях ", " Невелика ",
            " Некрасова ", " Немирівська ", " Нестора Літописця ", " Нечая ", " Нечуя-Левицького ", " не існує ",
            " Нижанківського ", " Низинна ", " Низова ", " Низький Замок ", " Ніжинська ", " Ніщинського ",
            " Новаківського ", " Новий Світ ", " Новознесенська ", " не існує ", " Огієнка ", " Огіркова ",
            " Оглоблина ", " Одеська ", " Ожешко ", " Ожинова ", " Озаркевича ", " Озерна ", " Околична ",
            " Окружна ", " Окуневського ", " Олесницького ", " Олеся ", " Олешківська ", " Олійна ", " Ольжича ",
            " Опільського ", " Опришківська ", " Орельська ", " Орлика Пилипа ", " Орлина ", " Орна ",
            " Освицька ", " Осикова ", " Остроградських ", " Острозького ", " Остряниці ", " Очаківська ",
            " Очеретяна ", " Павлика ", " Павлова ", " Павлокомська ", " Падури ", " Палія ", " Панаса сотника ",
            " Панаса сотника бічна ", " Панча ", " Панчишина ", " Паньківського ", " Папарівка ", " Папоротна ",
            " Параджанова ", " Паращука ", " Паркова ", " Парк Піскові Озера ", " Парк Високий Замок ",
            " Парк Горіховий Гай "," Парк Замарстинівський ", " Парк Івана Франка ", " Парк ім. Б.Хмельницького ",
            " Парк Левандівський ", " Парк Личаківський ", " Парк Скнилівський ", " Парк Стрийський ",
            " Парк Шевченківський Гай ", " Парова ", " Паровозна ", " Парфановичів ", " Пасіки Галицькі ",
            " Пасічна ", " Пастернака Ярослава ", " Патона ", " Пачовського ", " Пекарська ", " Перекопська ",
            " Перелітна ", " Перемиська ", " Переможна ", " Перехід ", " Переяславська ", " Перова ",
            " Персенківка ", " Персенківка станція ", " Перфецького ", " Петлюри ", " Петрицького ", " не існує ",
            " Петровського ", " Петрусенко ", " Петрушевича пл. ", " Пикулицька ", " Пирогівка ", " Пильникарська ",
            " Пимоненка ", " Пинська ", " Півколо ", " Плетенецького ", " Північна (Білогорща) ", " Підвальна ",
            " не існує ", " Підгаєцька ", " Підгірна ", " Під Голоском ", " Піддубного ", " Підзамче вул. ",
            " Підзамче станція ", " Підкови пл. ", " Підлісна ", " Підміська ", " Підмурна ", " Підрічна ",
            " Підстригача ", " Під Дубом ", " Пілотів ", " Піскова ", " Піша ", " Планерна ", " Пластова ",
            " Плетенецького ", " Плугова ", " Плужника ", " Плющова ", " Повітряна ", " Поворотна ",
            " Повстанська ", " Погідна ", " Погулянка ", " Подолинського ", " Поетична ", " Пожежників ",
            " Покутська ", " Поліська ", " Політехнічна ", " Поліщука ", " Половинна ", " Полтави П. ",
            " Полтв'яна ", " Полуботка ", " Полуднева ", " Полунична ", " Польна ", " Польова ", " Помірки ",
            " Поморянська ", " Поперечна ", " Поповича ", " Порічкова ", " Порохова ", " Потебні ", " Потелицька ",
            " не існує ", " Головний поштамт ", " Похила ", " Почаївська ", " Поштова ", " Прилбицька ",
            " Природна ", " Прихильна ", " Приязна ", " Прогулкова ", " Прокоповича ", " Промислова ",
            " Пропелерна ", " Просвіти ", " Проста ", " Простора ", " Професорська ", " Пстрака ", " Пташина ",
            " Пулюя ", " Пустомитівська ", " Пчілки Олени ", " Пшенична ", " П'ясецького ", " П'ятий парк ",
            " Равська ", " Радехівська ", " Радість ", " Райдужна ", " Райніса ", " Раковського ", " Ранкова ",
            " Раппапорта ", " Ратича ", " Ратича (№№ 65-73) ", " Рахівська ", " Ребета ", " Ревуцького ",
            " Резедова ", " Реміснича ", " Рєпіна ", " Ржегоржа ", " Рибна ", " Рилєєва ", " Рильського ",
            " Римлянина ", " Ринок пл. ", " Рівна ", " Рівненська ", " Рівнинна ", " Різні пл. ", " Різьбярська ",
            " Рільнича ", " Річицька ", " Робітнича ", " не існує ", " Рогатинців братів ", " Рожева ",
            " Розбіжна ", " Розвилиста ", " Розкіш ", " Розлога ", " Розсадна ", " Розточчя ", " Роксоляни ",
            " Романицького ", " Романчука ", " Ромашкова ", " Ромоданівська ", " Росиста ", " Рослинна ",
            " Россі Карла ", " Рубінова ", " Рубчака ", " Рудакі ", " Руданського ", " Рудненська ",
            " Рудницького ", " Рудно станція ", " Русових ", " Руставелі ", " Руська ", " Рутковича ", " Ручай ",
            " Рядова ", " Ряснянська ", " Ряшівська ", " Сагайдачного ", " не існує ", " Садибна ", " Садівнича ",
            " Садова ", " Садовського ", " Саковича ", " Саксаганського ", " Самарська ", " Самбірська ",
            " Самійленка ", " Самокиша ", " Самчука Уласа ", " Санітарна ", " Сарненська ", " Сар'яна ",
            " Сахарова ", " Свєнціцького ", " Свидницького ", " Світанкова ", " Світла ", " Свободи проспект ",
            " Святого Теодора пл. ", " Святого Юра пл. ", " Севастопольська ", " Севери ", " Сельських ",
            " Селянська ", " Семирадського ", " Сеньковича ", " Сербська ", " Сєченова ", " Сигнальна ",
            " Сигнівка ", " Симоненка В. ", " Синявського ", " Сихівська ", " Сімовича ", " Сінна ", " Сірка ",
            " Січинського ", " Січнева ", " Січова ", " Січових Стрільців ", " Скельна ", " Скидана ",
            " Скісна ", " Скляна ", " Скнилівок ", " Скнилівська ", " Скнилівський 1-й провулок ",
            " Скнилівський 2-й провулок ", " Скнилівський 3-й провулок ", " Скнилівський 4-й провулок ",
            " Скнилівський 5-й провулок ", " Скнилівський 6-й провулок ", " Скнилівський 7-й провулок ",
            " Скнилівський 8-й провулок ", " Скнилівський 9-й провулок ", " Скнилівський 10-й провулок ",
            " Скнилів станція ", " Сковороди ", " Скорини ", " Скрипника ", " Скромна ", " Сластіона ",
            " Сливова ", " Сліпого ", " Слобідська ", " Слободівни Марії ", " Словацького ", " Слов'янська ",
            " Слюсарська "," Смаль-Стоцького ", " Смерекова ", " не існує ", " не існує ", " Сметани ",
            " Сміла ", " Сміливих ", " Смолича ", " Смольського ", " Смотрицького ", " Снігурівська ",
            " Сніжна ", " Снопківська ", " Соборна пл. ", " Сокільницька ", " Солов'їна ", " Солодова ",
            " Солом'янка ", " Сонячна ", " Соняшникова ", " Сороки ", " Сорохтея ", " Сорочинська ", " Сосенка ",
            " Соснова ", " Сосюри ", " Спадиста ", " Спокійна ", " Сполучна ", " Сріблиста ", " Ставова ",
            " Ставропігійська ", " Стадників ", " Станційна ", " Станція Личаків вул. ", " Стара ",
            " Старий Ринок пл. ", " Старицького ", " Стародубська ", " Староєврейська ", " Старознесенська ",
            " Староміська ", " Стеблиста ", " Стельмаха ", " Степанівни ", " Степового ", " Стефаника ",
            " Стеценка ", " Стецька ", " Стешенка ", " Стороженка ", " Стрийська ", " Стрілецька ",
            " Стрімка ", " Струмок ", " Студентська ", " Студинського ", " Стуса ", " Суботівська ",
            " Судова ", " Сулими ", " Сумська ", " Сусідня ", " Суха ", " Сушка ", " Сушкевича ", " Східна ",
            " Сходова ", " Сяйво ", " Сянська ", " Табірна ", " Таджицька ", " Таллінська ", " Таманська ",
            " Танячкевича ", " Тарасівська ", " Таращанська ", " Тарнавка ", " Тарнавського М. ",
            " Татарбунарська ", " Татарська ", " Творча ", " Театральна ", " Теліги Олени ", " Темницьких ",
            " Тена Бориса ", " Теребовлянська ", " Терлецького ", " Тернова ", " Тернопільська ", " Тершаковців ",
            " Тесленка ", " Теслярська ", " Технічна ", " Тиверська ", " Тиктора ", " Тимошенків братів ",
            " Тисова ", " Тиха ", " Тичини ", " Тіниста ", " Тісна ", " Ткацька ", " Тобілевича ", " Толстого ",
            " Томашівська ", " Томашівського ", " Топольна ", " Топольний 1-й провулок ",
            " Топольний 2-й провулок ", " Топольний 3-й провулок ", " Топольний 4-й провулок ",
            " Топольний 5-й провулок ", " Топольний 6-й провулок ", " Торгова (пл.) ", " Торф'яна ",
            " Трависта ", " Трещаківського ", " Трильовського ", " Тролейбусна ", " Тростинна ", " Трускавецька ",
            " Труша ", " Труша ", " Бергмана, Фелліні, Трюффо, Іллєнка, Параджанова ", " Трясила ",
            " Туган-Барановського ", " Тунельна ", " Турецька ", " Туркменська ", " Турянського ",
            " Тучапського ", " Тюльпанова ", " Тютюнників ", " Угнівська ", " Угорська ", " Ударна ",
            " Удатного Мстислава ", " Ужгородська ", " Узбецька ", " Українки Лесі ", " Уманська ",
            " Університетська ", " Урожайна ", " Устияновича ", " не існує ", " Фабрична пл. ", " Федорова ",
            " Федьковича ", " Фещенка-Чопівського ", " Фіалкова ", " Філатова ", " Флінти ", " Франка вул. ",
            " Франка пл. ", " Фредра ", " Фурманська ", " Харківська ", " Хасевича ", " Хвильового ", " Хімічна ",
            " Хлібна ", " Хмельницького ", " Хмільова ", " Холмська ", " Холодна ", " Холодного ",
            " Холодноярська ", " Хорватська ", " Хоробрих ", " Хортицька ", " Хотинська ", " Хоткевича ",
            " Художня ", " Хуторівка ", " Цегельського ", " Центральний проїзд ", " Церетелі ", " Цетнерівка ",
            " Цехова ", " Циганівка ", " Чагарникова ", " Чайковського ", " Чарнецького ", " Червона ",
            " Червоної Калини проспект ", " Черемхова ", " Черемшини Марка ", " Черешнева ", " Черкаська ",
            " Чернеча Гора ", " Черника ", " Чернівецька ", " Чернігівська ", " Чесанівська ", " Чехова ",
            " Чечета ", " Чигиринська ", " Чижевського ", " Чикаленка ", " Чмоли ", " Чоловського ",
            " Чорновола проспект ", " Чорноморська ", " Чубинського ", " Чуваська ", " Чугайстра ", " Чукаріна ",
            " Чумацька ", " Чупринки ", " Чучмана ", " Шараневича ", " Шатківського ", " Шафарика ",
            " Шахтарська ", " Шашкевича пл. ", " Шведська ", " Шевська ", " Шевченка вул. ", " Шевченка проспект ",
            " Шептицьких ", " Шеремети ", " Широка ", " Шишманова ", " Шімзерів ", " Шкільна ", " Шкіряна ",
            " Шкрібляків ", " Шолом-Алейхема ", " Шопена ", " Шпитальна ", " Шполянська ", " Шумського ",
            " Шухевича Володимира ", " Щекавицька ", " Щепкіна ", " Щепова ", " Щирецька ", " Щоголева Я. ",
            " Щурата ", " Юнаківа ", " Юнацька ", " Яблунева ", " Яворівська ", " Яворницького ",
            " Яворського пл. ", " Яловець ", " Ялтинська ", " Янева ", " Яновського ", " Януша ", " Японська ",
            " Яреми ", " Яричівська ", " Ярова ", " Ярославенка ", " Ярославська ", " Ярошинської ", " Ясна ",
            " Яцкова "
};


}